app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."member_id" = 12
---
  def view_by_member
    @reservations = Reservation.where(member_id: 12)

INSERT INTO "reservations" ("code", "created_at", "event_id", "member_id", "ticket_quantity", "ticket_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save