app/controllers/search_controller.rb

  def index

    @clubs_data1 = []
    # If the search param with it's whitespace stripped off
    # actually has something left then search for it
    unless params[:search].nil? || params[:search].strip.empty?
      @clubs_data1 = Society.search(params[:search])
    end

    @events_data1 = []
    # If the search param with it's whitespace stripped off
    # actually has something left then search for it
    unless params[:search].nil? || params[:search].strip.empty?
      @events_data1 = Event.search(params[:search])
---
SELECT "societies".* FROM "societies" WHERE (society_name LIKE '%gdfgfd%')
SELECT "events".* FROM "events" WHERE (title LIKE '%gdfgfd%')

  def list_society
    @clubs_data_all = Society.all
---
SELECT "societies".* FROM "societies"

  def list_event
    @events_data_all = Event.all
---
SELECT "events".* FROM "events"