app/controllers/search_controller.rb

  def list
    @clubs_data_all = Society.all
---
SELECT "societies".* FROM "societies"