app/controllers/societies_controller.rb

INSERT INTO "societies" ("club_biz_administrator_email", "club_biz_administrator_name", "club_biz_administrator_phone_number", "club_nickname", "club_website", "created_at", "password", "president_email", "president_name", "president_phone_number", "registration_number", "society_name", "treasurer_email", "treasurer_name", "treasurer_phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @society = Society.new(society_params)

    respond_to do |format|
      if @society.save